webpackHotUpdate("static/development/pages/blog-post.js",{

/***/ "./blog/dist/post/2018/one.json":
/*!**************************************!*\
  !*** ./blog/dist/post/2018/one.json ***!
  \**************************************/
/*! exports provided: title, date, tag, bodyContent, bodyHtml, preview, dir, base, ext, sourceBase, sourceExt, default */
/***/ (function(module) {

module.exports = {"title":"软件工程师生存指南","date":"2018-10-12T00:00:00.000Z","tag":["工作"],"bodyContent":"我职业生涯的前几年是一个学习激烈的时期。\n\n我遇到了成为软件工程师的现实，并且不得不获得许多我不知道需要的技能。回想起来，知道我现在所知道的事情肯定会很好。\n\n所以，我写这本指南是为了帮助其他人根据我在最初几年作为专业人士，以及我自己和我的一些同事所指导的开发人员的经验。\n\n## 面试\n当您从事软件工程的职业生涯时，您将不得不面对一个无可争议的事实。采访很糟糕。\n\n他们对所有参与者都很糟糕。既然是面试官又是受访者，我可以证明面试是一个很大的时间，非常紧张，是未来工作表现的一个非常糟糕的指标。然而，它们是你和你的简历最好的准备所必需的邪恶。\n\n## 准备战斗\n如果您正在考虑从事软件工程，请务必学习一些最常见的编程面试问题，例如'FizzBu​​zz'：","bodyHtml":"<p>我职业生涯的前几年是一个学习激烈的时期。</p>\n<p>我遇到了成为软件工程师的现实，并且不得不获得许多我不知道需要的技能。回想起来，知道我现在所知道的事情肯定会很好。</p>\n<p>所以，我写这本指南是为了帮助其他人根据我在最初几年作为专业人士，以及我自己和我的一些同事所指导的开发人员的经验。</p>\n<h2>面试</h2>\n<p>当您从事软件工程的职业生涯时，您将不得不面对一个无可争议的事实。采访很糟糕。</p>\n<p>他们对所有参与者都很糟糕。既然是面试官又是受访者，我可以证明面试是一个很大的时间，非常紧张，是未来工作表现的一个非常糟糕的指标。然而，它们是你和你的简历最好的准备所必需的邪恶。</p>\n<h2>准备战斗</h2>\n<p>如果您正在考虑从事软件工程，请务必学习一些最常见的编程面试问题，例如'FizzBu​​zz'：</p>\n","preview":"","dir":"blog/dist/post/2018","base":"one.json","ext":".json","sourceBase":"one.md","sourceExt":".md"};

/***/ })

})
//# sourceMappingURL=blog-post.js.03f4de83f476b8e9c0ea.hot-update.js.map